//PWTALY16 JOB (600040,ALT),'ALT Y16 EXT',MSGLEVEL=(1,1),
//*  RESTART=STEPNAME.PROCSTEPNAME,
//   MSGCLASS=J,CLASS=P,USER=DP3BTCH,GROUP=TS2GRP,COND=(8,LE)
//*
//*********************************************************************
//* MODIFICATION HISTORY:                                             *
//*                                                                   *
//* DATE         PERSON  DESCRIPTION                                  *
//*-------------------------------------------------------------------*
//* 04/12/16     BJW     INITIAL IMPLEMENTATION                       *
//* 10/05/2018     JHW     ADD INCLUDE TO SORT WZZCA401 W/ NEW MEMBER *
//*********************************************************************
//*
//         SET DIPOND=P
//         SET DOPOND=P
//         SET LPOND=P
//         SET ACNTR=ALT
//*
//JOBLIB   DD    DSN=P.HMSY.LINKLIB,DISP=SHR
//*
//*********************************************************************
//* STEP0010 SORT NCTCASE FILE                                        *
//*            NOTE: P.HMS.TPL.ALT.IW.NCTCASE.TMP16                   *
//*                  P.HMS.TPL.ALT.IR.YOS2016.MATCH                   *
//*                IS NOT REQUIRED                                    *
//*                MAXCC LE 8 WILL RESET TO 0.                        *
//*********************************************************************
//STEP0010 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=P.HMSY.CARD.CNTL(WALY1600),DISP=SHR
//*
//EXEC0010 EXEC PGM=SORT,PARM='ABEND'
//SORTIN   DD  DSN=&DIPOND..HMS.TPL.&ACNTR..IR.NCTCASE.RFMT(+0),
//             DISP=SHR
//SORTOUT  DD  DSN=&DOPOND..HMS.TPL.&ACNTR..IW.NCTCASE.TMP16,
//             DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//             DCB=(RECFM=FB,LRECL=384,BLKSIZE=27648),
//             SPACE=(CYL,(350,35),RLSE)
//SYSIN    DD  DSN=&LPOND..HMSY.CARD.CNTL(WALS1600),DISP=SHR
//SORTWK01 DD  SPACE=(CYL,350),UNIT=(SORTWK)
//SORTWK02 DD  SPACE=(CYL,350),UNIT=(SORTWK)
//SORTWK03 DD  SPACE=(CYL,350),UNIT=(SORTWK)
//SORTWK04 DD  SPACE=(CYL,350),UNIT=(SORTWK)
//SORTWK05 DD  SPACE=(CYL,350),UNIT=(SORTWK)
//SORTWK06 DD  SPACE=(CYL,350),UNIT=(SORTWK)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*
//*******************************************************************
//* STEP0020 MATCH NCTCASE FILE TO YOS2016 PCF ON MA#
//*******************************************************************
//*
//EXEC0020 EXEC PGM=CASPCFAL
//*
//SRCPCFI  DD  DSN=&DIPOND..HMS.TPL.&ACNTR..IM.MA.YOS2016.SRCPCFC(0),
//             DISP=SHR
//CASEFLI  DD  DSN=&DOPOND..HMS.TPL.&ACNTR..IW.NCTCASE.TMP16,DISP=SHR
//SRCPCFO  DD  DSN=P.HMS.TPL.&ACNTR..IR.PCFCASE.YOS2016(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(1500,500),RLSE),
//             UNIT=(3390,10),
//             DCB=(MODLDSCB,RECFM=FB,LRECL=754,BLKSIZE=0)
//MATCHO   DD  DSN=P.HMS.TPL.&ACNTR..IR.YOS2016.MATCH,
//             DISP=(NEW,CATLG,DELETE),UNIT=3390,
//             SPACE=(CYL,(100,10),RLSE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)
//SYS004   DD  DSN=P.HMSY.CARD.CNTL(WZCA010),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
