 DELETE P.HMS.TPL.ALT.IR.WALCDF40.DB2CNTL   PURGE
 DELETE P.HMS.TPL.ALT.IW.PCFCASE.CURR.PREP  PURGE
 DELETE P.HMS.TPL.ALT.IW.PCFCASE.NEW        PURGE
 DELETE P.HMS.TPL.ALT.IR.PCFCASE.NEW.SRT    PURGE
 IF MAXCC LE 8 THEN SET MAXCC EQ 0
